#include<iostream>
#include "ReadText.h";
using namespace std; 
int MySum(int a, int b)
{
	int s = 0;
	s = a + b;
	return s;
}

int main() {
	int arr1[5] = { 200,100,50,25,30 };
	int a, b, c;
	a = 10;
	b = 20;
	a++;
	++b;
	c = a + b;
	cout << a << endl;
	cout << b << endl;
	cout << c << endl;
	for (int i = 1; i <= 5; i++) {
		cout << i << endl;
		a = a + a * i;
	}
	c = MySum(a, b);
	cout << c;
	
	MyLibrary::ReadText("OsamaAli");


	return 0;
}

/*
 step into (F11) :
	ÊŞæã ÈÊäİíÏ ÇáßæÏ ÓØÑ ÓØÑ áÇ ÊÚãá ÊÎØí áÇí ÔíÁ
	ÍÊì ÇáİäßÔä ÇáãÓÊÏÚÇÉ íŞæã ÈÊäİíÏåÇ ÓØÑ ÈÓØÑ

	step over (F10) :
	ÊäİÏ ÓØÑ ÇáßæÏ İí ÇáãÇíä æ
	áÇ ÊÏÎá İí ÊİÇÕíáå ãËáÇ áæ ßÇä åäÇß İäßÔä ÇÓÊÏÚíÊåÇ İí ÇáãÇíä æ ÏÇÎáåÇ İäßÔä
	ÇĞÇ ßäÊ ãÊÃßÏ ÇäåÇ ÕÍíÍÉ ÊÖÛØ ÓÊÇÈ ÇæİÑ æ ÊŞæã ÈÊØÈíŞ
	åĞÇ ÇáÓØÑ Èßá ÇáİäßÔä ãÑÉ æÇÍÏÉ æ ÊĞåÈ ááÓØÑ ÇáĞí ÈÚÏå

	step out (Shift + F11) :
	æÙíİÉ åĞÇ ÇáÇÎíÑ Çäå
	íŞæã ÈÇÑÌÇÚß Çáì ÇáãÇíä ãËáÇ áæ Çäß ÏÎáÊ Çáì ÇáİäßÔä ãä
	ÇáãÇíä Úä ØÑíŞ ÓÊÇÈ ÇäÊæ æ ÊÑíÏ Çä ÊØÈŞ ãÇ İí ÇáİäßÔä
	ÈãÑÉ æÇÍÏÉ æ ÊÑÌÚ ááãÇíä ÊŞæã ÈÇ ÓÊÚãÇá åĞå ÇáÎÇÕíÉ
*/


