#include<iostream> // ÊÖãíä ÇáãßÊÈÉ iostream ÇáÊí ÊÍÊæí Úáì ÇáÃÏæÇÊ ÇááÇÒãÉ ááÅÏÎÇá æÇáÅÎÑÇÌ.

using namespace std; // ÇÓÊÎÏÇã İÖÇÁ ÇáÃÓãÇÁ std¡ ÇáĞí íÍÊæí Úáì ãßæäÇÊ ãßÊÈÉ C++ ÇáŞíÇÓíÉ.

class clsA // ÈÏÇíÉ ÊÚÑíİ ÇáİÆÉ clsA.
{
public: // ÇáÌÒÁ ÇáÚÇã ááİÆÉ.

	//Parametarized Constructor
	// ÈäÇÁ ÈãÚáãÇÊ.
	clsA(int value ,short num) // ÊÚÑíİ ÇáÈäÇÁ ÇáãÚáã ÈÇáãÚáãÇÊ ááİÆÉ clsA.
	{
		x = value * num; // ÊÚííä ŞíãÉ ÇáãÚáãÉ value Åáì ÇáãÊÛíÑ x.
	}

	int x; // ÊÚÑíİ ãÊÛíÑ x áÊÎÒíä ÇáŞíãÉ.

	void Print() // ÊÚÑíİ ÏÇáÉ Print áØÈÇÚÉ ŞíãÉ ÇáãÊÛíÑ x.
	{
		cout << "The value of x=" << x << endl; // ØÈÇÚÉ ŞíãÉ ÇáãÊÛíÑ x.
	}

}; // äåÇíÉ ÊÚÑíİ ÇáİÆÉ clsA.

int main() // ÈÏÇíÉ ÊÚÑíİ ÇáÏÇáÉ ÇáÑÆíÓíÉ main.
{
	clsA opj[] = { clsA(12,2) ,clsA(22,2)  ,clsA(32,2) }; // ÊÚÑíİ ãÕİæİÉ ãä ßÇÆäÇÊ clsA.

	for (int i = 0; i < 3; i++) // ÈÏÇíÉ ÇáÍáŞÉ ÇáÊßÑÇÑíÉ ááæÕæá Åáì ÚäÇÕÑ ÇáãÕİæİÉ.
	{
		opj[i].Print(); // ÇÓÊÏÚÇÁ ÏÇáÉ Print áßá ÚäÕÑ İí ÇáãÕİæİÉ.
	}

	system("pause>0"); // ÊæŞİ ÇáÊäİíĞ ÍÊì íŞæã ÇáãÓÊÎÏã ÈÇáÖÛØ Úáì Ãí ãİÊÇÍ.
	return 0; // ÅÑÌÇÚ ÇáŞíãÉ 0 ááÅÔÇÑÉ Åáì äÌÇÍ ÊäİíĞ ÇáÈÑäÇãÌ.
} // äåÇíÉ ÊÚÑíİ ÇáÏÇáÉ ÇáÑÆíÓíÉ main.
