#include<iostream> // ÊÖãíä ãßÊÈÉ ÇáÅÏÎÇá æÇáÅÎÑÇÌ

using namespace std; // ÇÓÊÎÏÇã ãÓÇÍÉ ÇáÃÓãÇÁ std

class clsA // ÊÚÑíİ ÇáßáÇÓ clsA
{

public:
	int x; // ÊÚÑíİ ãÊÛíÑ ÚÖæí

	void Print() // ÊÚÑíİ ÏÇáÉ áØÈÇÚÉ ŞíãÉ ÇáãÊÛíÑ
	{
		cout << "The value of x=" << x << endl; // ØÈÇÚÉ ŞíãÉ ÇáãÊÛíÑ
	}

};

// ÊãÑíÑ ÇáßÇÆä ÈÇáŞíãÉ¡ Ãí ÊÍÏíË áä íÊã ÇäÚßÇÓå
// Úáì ÇáßÇÆä ÇáÃÕáí
void Fun1(clsA A1)
{

	A1.x = 100;
}


// ÊãÑíÑ ÇáßÇÆä ÈÇáãÑÌÚ¡ Ãí ÊÍÏíË ÓíÊã ÇäÚßÇÓå
// Úáì ÇáßÇÆä ÇáÃÕáí
void Fun2(clsA& A1)
{

	A1.x = 200;
}


int main()

{
	clsA A1; // ÅäÔÇÁ ßÇÆä ãä ÇáßáÇÓ clsA

	A1.x = 50; // ÊÚííä ŞíãÉ ááßÇÆä ÇáÃÕáí
	cout << "\nA.x before calling function1: \n"; // ØÈÇÚÉ ŞíãÉ ÇáßÇÆä ÇáÃÕáí
	A1.Print();


	// ÇáãÑæÑ ÈÇáŞíãÉ¡ áä íÊÃËÑ ÇáßÇÆä.
	Fun1(A1); // ÇÓÊÏÚÇÁ ÇáÏÇáÉ ÈÊãÑíÑ ÇáßÇÆä ÈÇáŞíãÉ
	cout << "\nA.x after calling function1 byval: \n"; // ØÈÇÚÉ ŞíãÉ ÇáßÇÆä ÈÚÏ ÇÓÊÏÚÇÁ ÇáÏÇáÉ ÈÇáŞíãÉ
	A1.Print();

	// ÇáãÑæÑ ÈÇáãÑÌÚ¡ ÓíÊÃËÑ ÇáßÇÆä.
	Fun2(A1); // ÇÓÊÏÚÇÁ ÇáÏÇáÉ ÈÊãÑíÑ ÇáßÇÆä ÈÇáãÑÌÚ
	cout << "\nA.x after calling function2 byref: \n"; // ØÈÇÚÉ ŞíãÉ ÇáßÇÆä ÈÚÏ ÇÓÊÏÚÇÁ ÇáÏÇáÉ ÈÇáãÑÌÚ
	A1.Print();


	system("pause>0"); // ÅíŞÇİ ÇáÈÑäÇãÌ

}
