#include <iostream>  // ÊÖãíä ãßÊÈÉ ÇáÅÏÎÇá æÇáÅÎÑÇÌ
#include "clsMyString.h"  // ÊÖãíä ÊÚÑíİ ÇáİÆÉ clsMyString

using namespace std;  // ÇÓÊÎÏÇã İÖÇÁ ÇáÃÓãÇÁ std áÊÌäÈ ßÊÇÈÉ std:: ŞÈá ÃÓãÇÁ ÇáÃäæÇÚ

int main()
{

    cout << "\n\n\t\t\t\t\t\t Undo/Redo Project\n\n";  // ØÈÇÚÉ ÚäæÇä ÇáÈÑäÇãÌ

    clsMyString S1;  // ÅäÔÇÁ ßÇÆä ãä ÇáİÆÉ clsMyString

    cout << "\nS1  = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1

    S1.Value = "1";  // ÊÚííä ÇáŞíãÉ "1" ááÓáÓáÉ ÇáäÕíÉ S1

    cout << "S1  = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1

    S1.Value = "2";  // ÊÚííä ÇáŞíãÉ "2" ááÓáÓáÉ ÇáäÕíÉ S1

    cout << "S1  = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1

    S1.Value = "3";  // ÊÚííä ÇáŞíãÉ "3" ááÓáÓáÉ ÇáäÕíÉ S1

    cout << "S1  = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1

    S1.Value = "4";  // ÊÚííä ÇáŞíãÉ "3" ááÓáÓáÉ ÇáäÕíÉ S1

    cout << "S1  = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1


    cout << "\n\nUndo: ";  // ØÈÇÚÉ ÚäæÇä ŞÓã ÇáÊÑÇÌÚ
    cout << "\n__________\n";

    S1.Undo();  // ÊäİíĞ ÚãáíÉ ÇáÊÑÇÌÚ
    cout << "\nS1  after undo = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1 ÈÚÏ ÇáÊÑÇÌÚ

    S1.Undo();  // ÊäİíĞ ÚãáíÉ ÇáÊÑÇÌÚ ãÑÉ ÃÎÑì
    cout << "S1  after undo = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1 ÈÚÏ ÇáÊÑÇÌÚ

    S1.Undo();  // ÊäİíĞ ÚãáíÉ ÇáÊÑÇÌÚ ãÑÉ ÃÎÑì
    cout << "S1  after undo = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1 ÈÚÏ ÇáÊÑÇÌÚ

    S1.Undo();  // ÊäİíĞ ÚãáíÉ ÇáÊÑÇÌÚ ãÑÉ ÃÎÑì
    cout << "S1  after undo = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1 ÈÚÏ ÇáÊÑÇÌÚ


    cout << "\n\nRedo: ";  // ØÈÇÚÉ ÚäæÇä ŞÓã ÅÚÇÏÉ ÇáÊÑÇÌÚ
    cout << "\n__________\n";

    S1.Redo();  // ÊäİíĞ ÚãáíÉ ÅÚÇÏÉ ÇáÊÑÇÌÚ
    cout << "\nS1  after Redo = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1 ÈÚÏ ÅÚÇÏÉ ÇáÊÑÇÌÚ

    S1.Redo();  // ÊäİíĞ ÚãáíÉ ÅÚÇÏÉ ÇáÊÑÇÌÚ ãÑÉ ÃÎÑì
    cout << "S1  after Redo = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1 ÈÚÏ ÅÚÇÏÉ ÇáÊÑÇÌÚ

    S1.Redo();  // ÊäİíĞ ÚãáíÉ ÅÚÇÏÉ ÇáÊÑÇÌÚ ãÑÉ ÃÎÑì
    cout << "S1  after Redo = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1 ÈÚÏ ÅÚÇÏÉ ÇáÊÑÇÌÚ

    S1.Redo();  // ÊäİíĞ ÚãáíÉ ÅÚÇÏÉ ÇáÊÑÇÌÚ ãÑÉ ÃÎÑì
    cout << "S1  after Redo = " << S1.Value << "\n";  // ØÈÇÚÉ ÇáŞíãÉ ÇáÍÇáíÉ ááÓáÓáÉ ÇáäÕíÉ S1 ÈÚÏ ÅÚÇÏÉ ÇáÊÑÇÌÚ

    system("pause>0");  // ÅíŞÇİ ÇáÈÑäÇãÌ ãÄŞÊğÇ ÍÊì íÊã ÖÛØ ãİÊÇÍ
    return 0;  // ÅäåÇÁ ÇáÈÑäÇãÌ
}
